KeyError - когато се опитате да получите достъп до ключ, който не е в речник (dict).
AttributeError - когато се направи невалидна препратка към атрибут(нещо което не описано/въведено)
ValueError - когато функция получи аргумент от правилния тип данни, но неподходяща стойност(примерно корен квадрат от отрицателно число)
NameError - когато, при изпълнение, не може да идентифицира глобалното или локалното име
TypeError - когато типът данни на обект в операция е неподходящ
IndexError - когато се направи опит за достъп до елемент в списък с индекс, който е извън границите
ModuleNotFoundError - когато се опитвате да получите достъп или да използвате модул, който не може да бъде намерен
ZeroDivisionError - когато се дели на нула
RuntimeError - когато Python разбира какво казвате, но среща проблеми, когато следва вашите инструкции
FileNotFoundError - когато файла не съществува, или е недостъпен
OSError - когато не може да се отварят файловое, забранени от администратор или не съществуват и системото дава грешка